//Задание 1. Совместная работа.
//Написать программу, которая на вход принимает два целых числа и проверяет, 
//является ли первое число квадратом второго.
int a = 3;
int b = 9;
if (a * a == b)
{
    Console.WriteLine("true");
}
else
{
    Console.WriteLine("false");
}
    